new-style/faq.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Frequently Asked Questions</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="stylesheets/manual.css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <ul class="center">
    <li> <a href="index.html">Overview</a>
    <li> <a href="https://github.com/joaotavora/yasnippet/blob/master/README.mdown">
        Intro and Tutorial</a>
    <li class="center border">Snippet
      <ul id="snippet-submenu">
        <li> <a href="snippet-organization.html">Organization</a>
        <li> <a href="snippet-expansion.html">Expansion</a>
        <li> <a href="snippet-development.html">Development</a>
        <li> <a href="snippet-menu.html">Menu</a>
      </ul>
    <li> <span class='current'>FAQ</span>
    <li> <a href="snippet-reference.html">Reference</a>
  </ul>
</nav>
</div>
<div id="content">
<h1 class="title">Frequently Asked Questions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org64f1b8c">Why is there an extra newline?</a></li>
<li><a href="#org3e0ab30">Why doesn't TAB navigation work with flyspell</a></li>
<li><a href="#org5f4a84d">How do I use alternative keys, i.e. not TAB?</a></li>
<li><a href="#orgf731e45">How do I turn off the minor mode where in some buffers?</a></li>
<li><a href="#org096bf1a">How do I define an abbrev key containing characters not supported by the filesystem?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org64f1b8c" class="outline-2">
<h2 id="org64f1b8c">Why is there an extra newline?</h2>
<div class="outline-text-2" id="text-org64f1b8c">
<p>
If there is a newline at the end of a snippet definition file,
YASnippet will add a newline when expanding that snippet. When editing
or saving a snippet file, please be careful not to accidentally add a
terminal newline.
</p>

<p>
Note that some editors will automatically add a newline for you. In
Emacs, if you set <code>require-final-newline</code> to <code>t</code>, it will add the
final newline automatically.
</p>
</div>
</div>

<div id="outline-container-org3e0ab30" class="outline-2">
<h2 id="org3e0ab30">Why doesn't TAB navigation work with flyspell</h2>
<div class="outline-text-2" id="text-org3e0ab30">
<p>
A workaround is to inhibit flyspell overlays while the snippet is
active:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'flyspell-incorrect-hook
          #'(lambda (dummy1 dummy2 dymmy3)
              (<span class="org-keyword">and</span> yas-active-field-overlay
                   (overlay-buffer yas-active-field-overlay))))
</pre>
</div>

<p>
This is apparently related to overlay priorities. For some reason, the
<code>keymap</code> property of flyspell's overlays always takes priority over the
same property in YASnippet's overlays, even if one sets the latter's
<code>priority</code> property to something big. If you know emacs-lisp and can
solve this problem, drop a line in the
<a href="http://groups.google.com/group/smart-snippet">discussion group</a>.
</p>
</div>
</div>

<div id="outline-container-org5f4a84d" class="outline-2">
<h2 id="org5f4a84d">How do I use alternative keys, i.e. not TAB?</h2>
<div class="outline-text-2" id="text-org5f4a84d">
<p>
Edit the keymaps <a href="snippet-reference.html#yas-minor-mode-map"><code>yas-minor-mode-map</code></a> and
<a href="snippet-reference.html#yas-keymap"><code>yas-keymap</code></a> as you would any other keymap:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key yas-minor-mode-map (kbd <span class="org-string">"&lt;tab&gt;"</span>) nil)
(define-key yas-minor-mode-map (kbd <span class="org-string">"TAB"</span>) nil)
(define-key yas-minor-mode-map (kbd <span class="org-string">"&lt;the new key&gt;"</span>) yas-maybe-expand)

<span class="org-comment-delimiter">;;</span><span class="org-comment">keys for navigation</span>
(define-key yas-keymap [(tab)]       nil)
(define-key yas-keymap (kbd <span class="org-string">"TAB"</span>)   nil)
(define-key yas-keymap [(shift tab)] nil)
(define-key yas-keymap [backtab]     nil)
(define-key yas-keymap (kbd <span class="org-string">"&lt;new-next-field-key&gt;"</span>) 'yas-next-field-or-maybe-expand)
(define-key yas-keymap (kbd <span class="org-string">"&lt;new-prev-field-key&gt;"</span>) 'yas-prev)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf731e45" class="outline-2">
<h2 id="orgf731e45">How do I turn off the minor mode where in some buffers?</h2>
<div class="outline-text-2" id="text-orgf731e45">
<p>
The best way, since version 0.6.1c, is to set the default value of the
variable <a href="snippet-reference.html#yas-dont-activate"><code>yas-dont-activate</code></a> to a lambda function like so:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-default 'yas-dont-activate
             #'(lambda ()
                 (<span class="org-keyword">and</span> yas-root-directory
                      (null (yas-get-snippet-tables)))))
</pre>
</div>

<p>
This is also the default value starting for that version. It skips the
minor mode in buffers where it is not applicable (no snippet tables),
but only once you have setup your yas-root-directory.
</p>
</div>
</div>

<div id="outline-container-org096bf1a" class="outline-2">
<h2 id="org096bf1a">How do I define an abbrev key containing characters not supported by the filesystem?</h2>
<div class="outline-text-2" id="text-org096bf1a">
<ul class="org-ul">
<li><b>Note</b>: This question applies if you're still defining snippets
whose key <i>is</i> the filename. This is behavior still provided by
version 0.6 for backward compatibilty, but is somewhat
deprecated&#x2026;</li>
</ul>

<p>
For example, you want to define a snippet by the key <code>&lt;</code> which is not a
valid character for filename on Windows. This means you can't use the
filename as a trigger key in this case.
</p>

<p>
You should rather use the <code># key:</code> directive to specify the key of the
defined snippet explicitly and name your snippet with an arbitrary valid
filename, <code>lt.YASnippet</code> for example, using <code>&lt;</code> for the <code># key:</code>
directive:
</p>

<div class="org-src-container">
<pre class="src src-snippet"><span class="org-comment"># key: &lt;</span>
<span class="org-comment"># name: &lt;...&gt;&lt;/...&gt;</span>
<span class="org-comment"># --</span>
&lt;<span class="org-keyword">${</span><span class="org-warning">1</span><span class="org-keyword">:</span>div<span class="org-keyword">}</span>&gt;<span class="org-keyword">$</span><span class="org-string">0</span>&lt;/<span class="org-keyword">$</span><span class="org-string">1</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><p class='creator'>Generated by <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.0.90 (<a href="http://orgmode.org">Org</a> mode 9.1.2) from 0.12.2-37-gdc6d7d2 (2018-02-18 12:46:06)</p>
<p class='xhtml-validation'><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
